app/views/private_data/_form.html.erb

    <th><%= f.label "性別" %></th>
    <th><%= f.select :gender_id, options_from_collection_for_select(Gender.all, :id, :name, @private_datum.gender_id) %></th>
---
SELECT "genders".* FROM "genders"

    <th><%= f.label "生日" %></th>
    <th><%= f.select :birthy_id, options_from_collection_for_select(Birthy.all, :id, :name, @private_datum.birthy_id) %>
---
SELECT "birthies".* FROM "birthies"

    <%= f.label "/" %>
    <%= f.select :birthm_id, options_from_collection_for_select(Birthm.all, :id, :name, @private_datum.birthm_id) %>
---
SELECT "birthms".* FROM "birthms"

    <%= f.label "/" %>
    <%= f.select :birthd_id, options_from_collection_for_select(Birthd.all, :id, :name, @private_datum.birthd_id) %></th>
---
SELECT "birthds".* FROM "birthds"

    <th><%= f.label "血型" %></th>
    <th><%= f.select :blood_id, options_from_collection_for_select(Blood.all, :id, :name, @private_datum.blood_id) %></th>
---
SELECT "bloods".* FROM "bloods"

    <th><%= f.text_field(:school, size:14) %>
    <%= f.select :schoolg_id, options_from_collection_for_select(Schoolg.all, :id, :name, @private_datum.schoolg_id) %>
---
SELECT "schoolgs".* FROM "schoolgs"

    <%= f.label "班" %>
    <%= f.select :schoolt_id, options_from_collection_for_select(Schoolt.all, :id, :name, @private_datum.schoolt_id) %></th>
---
SELECT "schoolts".* FROM "schoolts"

    <th><%= f.label "吃素" %></th>
    <th><%= f.select :vegetrian_id, options_from_collection_for_select(Vegetrian.all, :id, :name, @private_datum.vegetrian_id) %></th>
---
SELECT "vegetrians".* FROM "vegetrians"

    <th><%= f.label "T恤大小" %></th>
    <th><%= f.select :tshirtsize_id, options_from_collection_for_select(Tshirtsize.all, :id, :name, @private_datum.tshirtsize_id) %></th>
---
SELECT "tshirtsizes".* FROM "tshirtsizes"

      <th><%= f.label "第一順位" %></th>
      <th><%= f.select :fpick, options_from_collection_for_select(Camp.all, :id, :name, @private_datum.fpick) %></th>
---
SELECT "camps".* FROM "camps"