app/views/private_data/index.html.erb

SELECT  "genders".* FROM "genders" WHERE "genders"."id" = ? LIMIT 1  [["id", 1]]
---
        <td><%= private_datum.nickname %></td>
        <td><%= Gender.find(private_datum.gender_id).name %></td>