app/views/private_data/show.html.erb

SELECT  "genders".* FROM "genders" WHERE "genders"."id" = ? LIMIT 1  [["id", 1]]
---
  <th>性別</th>
  <th><%= Gender.find(@private_datum.gender_id).name %></th>

SELECT  "birthds".* FROM "birthds" WHERE "birthds"."id" = ? LIMIT 1  [["id", 16]]
SELECT  "birthies".* FROM "birthies" WHERE "birthies"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "birthms".* FROM "birthms" WHERE "birthms"."id" = ? LIMIT 1  [["id", 2]]
---
  <th>生日</th>
  <th><%= Birthy.find(@private_datum.birthy_id).name+"/"+Birthm.find(@private_datum.birthm_id).name+"/"+Birthd.find(@private_datum.birthd_id).name %></th>

SELECT  "bloods".* FROM "bloods" WHERE "bloods"."id" = ? LIMIT 1  [["id", 4]]
---
  <th>血型</th>
  <th><%= Blood.find(@private_datum.blood_id).name+"型" %></th>

SELECT  "schoolgs".* FROM "schoolgs" WHERE "schoolgs"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "schoolts".* FROM "schoolts" WHERE "schoolts"."id" = ? LIMIT 1  [["id", 2]]
---
  <th>學校</th>
  <th><%= @private_datum.school+" "+Schoolg.find(@private_datum.schoolg_id).name+" "+@private_datum.schoolc+"班 "+Schoolt.find(@private_datum.schoolt_id).name %></th>

SELECT  "vegetrians".* FROM "vegetrians" WHERE "vegetrians"."id" = ? LIMIT 1  [["id", 2]]
---
  <th>吃素</th>
  <th><%= Vegetrian.find(@private_datum.vegetrian_id).name %></th>

SELECT  "tshirtsizes".* FROM "tshirtsizes" WHERE "tshirtsizes"."id" = ? LIMIT 1  [["id", 3]]
---
  <th>T恤大小</th>
  <th><%= Tshirtsize.find(@private_datum.tshirtsize_id).name %></th>

SELECT  "camps".* FROM "camps" WHERE "camps"."id" = ? LIMIT 1  [["id", 1]]
---
  <th>第一順位</th>
  <th><%= Camp.find(@private_datum.fpick).name %></th>