app/controllers/camps_controller.rb

SELECT "camps".* FROM "camps"
---
  def index
    @camps = Camp.all

INSERT INTO "camps" ("ind", "name", "cost", "day", "date", "num", "account_name", "account_ind", "address", "contact", "expect", "intro", "ps", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @camp = Camp.new(camp_params)

    respond_to do |format|
      if @camp.save

UPDATE "camps" SET "contact" = ?, "updated_at" = ? WHERE "camps"."id" = ?  [["contact", "營長 劉亘浩 0978069928 tom840501@gmail.com 執秘 施秉洋 0963692885 jhon408408@gmail.com張敬晨 0953830928 deborah830928@gmail.com"], ["updated_at", "2016-02-07 11:30:03.555521"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @camp.update(camp_params)

SELECT  "camps".* FROM "camps" WHERE "camps"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_camp
      @camp = Camp.find(params[:id])