app/controllers/private_data_controller.rb

  def create
    @private_datum = current_user.private_data.build(private_datum_params)

    respond_to do |format|
      if @private_datum.save
---
INSERT INTO "private_data" ("name", "nickname", "gender_id", "birthy_id", "birthm_id", "birthd_id", "personcard", "blood_id", "school", "schoolg_id", "schoolc", "schoolt_id", "address", "email", "fb", "cellphone", "urgentn", "urgentr", "urgentc", "specialeat", "specialsick", "vegetrian_id", "tshirtsize_id", "intro", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)